import 'package:flutter/material.dart';
import 'package:flutter_svg/svg.dart';
import 'package:get/get.dart';
import 'package:quiz/ui/shared/custom_widgets/custom_widget.dart';
import 'package:quiz/ui/shared/utils.dart';
import 'package:quiz/ui/views/application_details_view/appliction_details_view.dart';
import 'package:quiz/ui/views/questions_view/question_view_shimmer.dart';
import 'package:quiz/ui/views/questions_view/questions_controller.dart';
import '../../shared/colors.dart';
import '../../shared/custom_widgets/coustom_question_container.dart';
import '../../shared/custom_widgets/custom_button.dart';

class QuestionsView extends StatefulWidget {
  const QuestionsView({super.key});
  @override
  State<QuestionsView> createState() => _QuestionsViewState();
}

class _QuestionsViewState extends State<QuestionsView> {
  QuestionsController controller = Get.put(QuestionsController());
  @override
  Widget build(BuildContext context) {
    int temp = -1;
    return CustomWidget(
        text: "كلية الهندسة المعلوماتية / الشبكات /الدورات",
        body: Obx(() {
          return Padding(
            padding: EdgeInsets.symmetric(
              horizontal: screenWidth(28),
            ),
            child: Column(
                //crossAxisAlignment: CrossAxisAlignment.start,
                children: [
                  Padding(
                    padding: EdgeInsets.only(
                        left: screenWidth(1.35),
                        bottom: screenWidth(50),
                        top: screenWidth(4)),
                    child: Text(
                        '100/${(controller.spinnerValue.value * 100).toInt()}'),
                  ),
                  ClipRRect(
                    borderRadius: BorderRadius.circular(screenWidth(20)),
                    child: LinearProgressIndicator(
                      backgroundColor: AppColors.mainDarkPurple,
                      value: controller.spinnerValue.value,
                      color: AppColors.mainBlueColor,
                      minHeight: screenWidth(60),
                    ),
                  ),
                  SizedBox(
                    height: screenWidth(20),
                  ),
                  controller.isQuestionLoading
                      ? QuestionViewShimmer()
                      : Column(
                          crossAxisAlignment: CrossAxisAlignment.start,
                          children: [
                              Padding(
                                padding:
                                    EdgeInsets.only(right: screenWidth(50)),
                                child: Text(
                                  controller
                                      .questionList[
                                          controller.currentQuestionIndex.value]
                                      .questionText
                                      .toString(),
                                  softWrap: true,
                                  style: TextStyle(fontSize: screenWidth(27)),
                                ),
                              ),
                              SizedBox(
                                height: screenWidth(30),
                              ),
                              Container(
                                height: screenWidth(0.88),
                                child: ListView(
                                    primary: true,
                                    shrinkWrap: true,
                                    children: controller
                                        .questionList[controller
                                            .currentQuestionIndex.value]
                                        .answers!
                                        .map((answer) {
                                      return CustomQuestionContainer(
                                        value: answer.id!,
                                        selected:
                                            controller.selectedAnswers.value[
                                                controller.currentQuestionIndex
                                                    .value],
                                        onTaped: controller.showAnswer[
                                                    controller
                                                        .currentQuestionIndex
                                                        .value] !=
                                                -1
                                            ? (Value) {}
                                            : (value) {
                                                if (temp <
                                                    controller
                                                        .currentQuestionIndex
                                                        .value) {
                                                  temp = controller
                                                      .currentQuestionIndex
                                                      .value;
                                                  controller.incresSlider();
                                                }
                                                controller.selectAnswer(value!);

                                                if (controller
                                                        .questionList[controller
                                                            .currentQuestionIndex
                                                            .value]
                                                        .correctId ==
                                                    controller.selectedAnswers[
                                                        controller
                                                            .currentQuestionIndex
                                                            .value]) {
                                                  controller.isCorrect(true);
                                                  controller
                                                      .correctAnswers.value++;
                                                } else {
                                                  controller
                                                      .erroranswer.value++;
                                                }
                                              },
                                        answerText: answer.text,
                                        isVisibleAnswerResult: (answer.id ==
                                                controller
                                                        .selectedAnswers.value[
                                                    controller
                                                        .currentQuestionIndex
                                                        .value])
                                            ? controller.showAnswer[controller
                                                    .currentQuestionIndex
                                                    .value] ==
                                                controller
                                                    .currentQuestionIndex.value
                                            : false,
                                        isCorrect: controller.isCorrectAnswer[
                                            controller
                                                .currentQuestionIndex.value],
                                      );
                                    }).toList()),
                              )
                            ]),
                  Padding(
                    padding: EdgeInsets.only(
                        right: screenWidth(80), bottom: screenWidth(18)),
                    child: Row(
                      children: [
                        CustomIconsItem(
                          imageName: "ic_correct",
                          colorIcon: AppColors.mainBlueColor,
                          onTap: () {
                            controller.shownAnswer(
                                controller.currentQuestionIndex.value);
                          },
                        ),
                        Padding(
                            padding: EdgeInsets.symmetric(
                                horizontal: screenWidth(30)),
                            child: CustomIconsItem(
                              imageHeight: screenWidth(22),
                              imageName: 'ic_reference',
                              onTap: () {
                                Get.to(ApplicationDetailsView());
                              },
                            )),
                        CustomIconsItem(
                          imageName: controller.isSelectImportant.value
                              ? "ic_star_yellow"
                              : "ic_star",
                          onTap: () {
                            if (controller.isSelectImportant.value) {
                              controller.isSelectImportant.value = false;
                            } else {
                              controller.isSelectImportant.value = true;
                            }
                          },
                        )
                      ],
                    ),
                  ),
                  Row(
                    mainAxisAlignment: MainAxisAlignment.spaceBetween,
                    children: [
                      CustomButton(
                        text: "السابق",
                        backgroundColor: AppColors.mainWhiteColor,
                        textColor: AppColors.mainBlueColor,
                        borderColor: AppColors.mainBlueColor,
                        textSize: screenWidth(27),
                        width: screenWidth(4.7),
                        hight: screenWidth(10),
                        onPressed: () {
                          controller.backQuestion();
                        },
                      ),
                      CustomButton(
                        text: "التالي",
                        backgroundColor: AppColors.mainDarkPurple,
                        textColor: AppColors.mainWhiteColor,
                        borderColor: AppColors.mainDarkPurple,
                        textSize: screenWidth(27),
                        width: screenWidth(4.7),
                        hight: screenWidth(10),
                        onPressed: () {
                          controller.selectedAnswers[
                                      controller.currentQuestionIndex.value] ==
                                  -1
                              ? null
                              : controller.nextQuestion();
                        },
                      ),
                    ],
                  ),
                  // Text('${questions.length}')
                ]),
          );
        }));
  }
}

Widget CustomIconsItem(
    {required String imageName,
    required Function onTap,
    Color? colorIcon,
    double? imageHeight}) {
  return InkWell(
    onTap: () {
      onTap();
    },
    child: SvgPicture.asset(
      "assets/images/$imageName.svg",
      color: colorIcon,
      height: imageHeight,
    ),
  );
}

final List<Map<String, Object>> questions = [
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '2. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 2
  },
  {
    'questionText': '3. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 3
  },
  {
    'questionText': '4. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 4
  },
  {
    'questionText': '5. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 5
  },
  {
    'questionText': '6. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '7. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '8. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '9. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '10. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '11. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '12. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '13. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '14. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '15. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '16. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '17. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '18. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '19. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '20. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '21. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '22. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '23. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة', 'id': 3},
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '24. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '25. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '26. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '27. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '28. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '29. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '30. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '31. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '32. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '32. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '33. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '34. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '35. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '36. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
  {
    'questionText': '1. الخدمة بأفضل جهد في بروتوكول الانترنت IPV4 تعني ان :',
    "answers": [
      {
        "text":
            "بروتوكول الانترنت لا يقدم اليات تحكم بالتدفق او التحكم بالاأخطاء",
        "id": 1
      },
      {
        'text': 'بروتوكول الانترنت يقدم اليات تحكم بالتدفق و التحكم بالأخطاء',
        'id': 2
      },
      {
        'text': 'بروتوكول الأنترنت صالح لتطبيقات الوسائط المتعددة',
        'id': 3,
      },
      {'text': 'بروتوكول الانترنت يطبق بشكل موثوق ضمن الشبكة البينية', 'id': 4},
      {
        'text': 'بروتوكول الانترنت هو بروتوكول موثوق و أمن لنقل المعطيات',
        'id': 5,
      }
    ],
    'correct_id': 1
  },
];
